import React from 'react';

// ข้อมูลตัวอย่าง
const sampleData = [
  {
    id: 1,
    name: 'กัญชาสายพันธุ์ใดรุนแรงที่สุด',
    description: 'ในขณะที่ THC อาจจะเป็นสารหลักที่ขับเคลื่อนความรุนแรงของกัญชา สาร THC คืออะไร? แต่เทอร์ปีนส์ก็มีส่วนสำคัญที่ช่วยเพิ่มและส่งเสริมความเมาของกัญชาสายพันธุ์นั้น ๆ  เทอร์ปีนส์นั้นคือสสารกลิ่นแรงที่เป็นตัวสร้างกลิ่นเฉพาะตัวให้กับกัญชาสายพันธุ์ต่าง ๆ (เช่นเดียวกับมายร์ซีน คาริโอไฟลีน และลิโมนีน) และสายพันธุ์กัญชาที่เปี่ยมไปด้วยเทอร์ปีนส์และ THC นั้นมักจะส่งผลดีกว่าพันธุ์ที่มีความหลาก',
    price: 1099,
    img: '1.webp',
    content: 'ขาอ่อนปวกเปียกไปเลยครับ แถมร่างกายก็ผ่อนคลาย มันทำให้ผมเห็นทุกอย่างชัดเจนแถมยังเพิ่มความคิดสร้างสรรค์ให้อีกด้วย'
  },
  {
    id: 2,
    name: 'สายพันธุ์ GSC',
    description: 'GSC และลูกหลานพันธุ์ผสมกับคุกกี้อันหลายของมันนั้นไต่เต้าความนิยมขึ้นมาได้ไกลในช่วงปีกลาย ถือว่าเหมาะสมทีเดียว คุณจะสามารถสัมผัสได้ถึงความสุขอันเอ่อล้นราวกับคลื่นซัดซาดทั้งกายใจและความอุ่นกายสบายใจไปนานหลายชั่วโมง',
    price: 1870,
    img: '2.webp',
    content: 'ขาอ่อนปวกเปียกไปเลยครับ แถมร่างกายก็ผ่อนคลาย มันทำให้ผมเห็นทุกอย่างชัดเจนแถมยังเพิ่มความคิดสร้างสรรค์ให้อีกด้วย'
  },
  {
    id: 3,
    name: 'สายพันธุ์ Kosher Kush',
    description: 'พันธุ์ Kosher Kush ถือกำเนิดขึ้นบนโลกในช่วงปี ค.ศ. 2010 และชนะรางวัลประกวดกัญชาอยู่เรื่อยมา ประวัติกรรมพันธุ์ของสายพันธุ์นี้ไม่ปรากฏแน่ชัด แต่ผู้ที่เพาะพันธุ์มันขึ้นมาได้นั้นถือเป็นผู้ชนะในด้านพันธุกรรมโดยแท้จริง เพียงแค่มองเห็นเรซินที่ปกคลุมอยู่โดยรอบดอกก็อาจบอกได้ว่ากัญชาสายพันธุ์อินดิคานี้ไม่ได้มาเล่น ๆ',
    price: 1870,
    img: '3.webp',
    content: 'ผมไม่รู้สึกหน้า…หรือแขน หรือเท้า หรืออะไรเลยครับ เหมือนกับว่าผมเป็นสสารไร้น้ำหนักที่สติพร่าเลือนและล่องลอยอยู่บนลานกว้าง'
  },
  {
    id: 4,
    name: 'สายพันธุ์ Ghost OG',
    description: 'โกสต์โอจีเป็นสายพันธุ์กัญชาที่เพาะขึ้นมาเพื่อความรู้สึกเคลิบเคลิ้มแบบอ็อกเทนสูง ตัวดอกปกคลุมไปด้วยเรซินสีขาวสะอาด สายพันธุ์นี้ถูกตัดออกจากสายโอจีคุชแบบดั้งเดิม เพราะความรุนแรงของโกสโอจีนั้นมีผลมาจากเทอร์ปีนส์หลากหลายที่ผสมผสานกันและส่งเสริม THC ที่รุนแรง ลองหามุมนั่งสบาย ๆ และปล่อยตัวปล่อยใจไปกับความเคลิบเคลิ้มอันรุนแรงที่เหมาะจะใช้เพื่อการผ่อนคลาย',
    price: 1870,
    img: '4.webp',
    content: 'เทอร์ปีนส์ตัวหลัก ไมร์ซีน ลิโมนีน คาริโอไฟลีน THC เฉลี่ย 20%'
  },
  {
    id: 5,
    name: 'สายพันธุ์ Bruce Banner',
    description: 'Bruce Banner ได้รับการตั้งชื่อตามร่างจริงของฮัลค์ ที่รุนแรงสมชื่อเลยทีเดียว พันธุ์นี้เป็นลูกผสมที่มี THC สูงมาก ได้รับการขนานนามจากนิตยสาร High Times ว่าเป็นพันธุ์กัญชาที่แรงที่สุดในปี 2014 หลังจากชนะการประกวดคานนาบิส คัพ ในเด็นเวอร์ปี 2013 ทำให้กลานเป็นพันธุ์ขึ้นชื่อไปในทันที พลังที่ได้รับมาจากยีนส์ของสายพันธุ์ OG Kush และ Strawberry Diesel ทำให้ BB ส่งผลทำให้มีความเปรมปรีดิ์แบบหนักหน่วงและทำให้ร่างกายอยู่ในภาวะผ่อนคลายอย่างล้ำลึกอีกด้วย',
    price: 1870,
    img: '5.webp',
    content: 'เทอร์ปีนส์ตัวหลัก ไมร์ซีน ลิโมนีน คาริโอไฟลีน THC เฉลี่ย 23%'
  },
  {
    id: 6,
    name: 'สายพันธุ์ Ghost Train Haze',
    description: 'พันธุ์นี้ถูกเพาะขึ้นโดยกลุ่ม Rare Darkness Seeds สายพันธุ์ Ghost Train Haze นี้เป็นพันธุ์ที่มีชีวิตชีวาและสดใสเป็นอย่างยิ่ง มันได้รับยีนส์มาจากพันธุ์ Ghost OG และ Nevil’s Wreck ทำให้ความมึนเมานั้นพุ่งเป้าไปที่สมองโดยตรง ช่วยเพิ่มสมาธิและความคิดสร้างสรรค์',
    price: 1870,
    img: '6.webp',
    content: 'ปฏิกิริยาแรกของผมคือแหกปากตะโกน มันแรงเสียจนแทบจะบ้า แต่ก็นุ่มและหอมกลิ่นซีตรัส แต่แรงมากครับ ผมบอกไปหรือยังครับว่ามันแรง มันแรงมากจริง ๆ เป็นพันธุ์ซาติวาที่เหนือระดับจริง ๆ ทำเอาผมรู้สึกเหมือนเป็นคนเพิ่งเริ่มสูบเลย ระวังกันนะครับ มันแรงมากจริง ๆ'
  },
  {
    id: 7,
    name: 'สายพันธุ์ Chemdog',
    description: 'Chemdog เป็นสายพันธุ์คลาสสิคที่มีฐานแฟนคลับเหนียวแน่นเพราะความรุนแรง Chemdog แม้จะมีกลิ่นน้ำมันที่รุนแรงแบบเฉพาะตัวแต่ก็ให้รสชาติที่ลืมไม่ลงแถมความเมาที่เติมพลัง ช่วยเพิ่มความคิดสร้างสรรค์และลดความเครียดได้ดี',
    price: 1870,
    img: '7.webp',
    content: 'ผมรู้สึกเหมือนอยู่ในน้ำเกรวี่ และผมมีความสุขมาก'
  },
  {
    id: 8,
    name: 'สายพันธุ์ Original Glue',
    description: 'Original Glue ได้ชื่อนี้เพราะความเหนียวของดอกที่ชุ่มไปด้วยเรซิน ความรุนแรงของสายพันธุ์นี้เป็นที่เลื่องลือ พร้อมยังมีรางวัลคานนาบิส คัพ อีกหลายครั้งเป็นเครื่องยืนยันถึงความสุดยอด แต่เราคิดว่าคุณคงไม่การข้อพิสูจน์อะไรเท่าไรเมื่อคุณล้มตัวลงบนโซฟาและนอนเคลิบเคลิ้มอย่างเปี่ยมสุข',
    price: 1870,
    img: '8.webp',
    content: 'เทอร์ปีนส์ตัวหลัก คาริโอไฟลีน ลิโมนีน ไมร์ซีน THC เฉลี่ย 20%'
  },
  {
    id: 9,
    name: 'สายพันธุ์ The White',
    description: 'ตั้งชื่อพันธุ์ตามเรซินที่เปลี่ยนเป็นคริสตัลสีขาวครอบดอกตูมเอาไว้ The White เป็นพันธุ์ฟ้าประทานสำหรับบรรดานักเพาะที่ต้องการนำความรุนแรงจากยีนส์ของมันไปใช้ The White มอบความรู้สึกเปี่ยมสุขที่หนักหน่วงราวกับพายุเสียจนทำให้ร่างกายต้องผ่อนคลายเพราะยอมจำนน',
    price: 1870,
    img: '9.webp',
    content: 'เทอร์ปีนส์ตัวหลัก คาริโอไฟลีน ไมร์ซีน ลิโมนีน THC เฉลี่ย 21%'
  },
  {
    id: 10,
    name: 'สายพันธุ์ Death Star',
    description: 'เมื่อ Sensi Star และ Sour Diesel มารวมพลังหลอนประสาทกัน ก่อให้เกิดเป็นลูกผสมนาม Death Star ที่สั่งให้คุณต้องชิลด้วยความสุขอันเปี่ยมล้นและฤทธิ์ระงับประสาทของตัวมัน',
    price: 1870,
    img: '10.webp',
    content: 'ไม่มีทางเลยที่คนอื่นจะไม่รู้ว่าคุณเมา Death Star อยู่ ผมกับเพื่อนไปซื้อต้นคริสมาสต์กันในวันที่หนาวโคตร ๆ เราใช้เวลาไป 45 นาทีกว่าจะเลือกต้นไม้ได้…มันคือต้นแรกที่เห็นนั่นแหละ แล้วเราก็ไปต่อกันที่บาร์ ผมนึกว่ากระจกเป็นหน้าต่างไปเสียฉิบ'
  },
  {
    id: 11,
    name: 'สายพันธุ์ White Fire OG',
    description: 'ลูกผสมของ The White และ Fire OG White Fire OG (หรือที่รู้จักกันในนาม WiFi OG) ไม่ได้มาเล่น ๆ ฤทธิ์ทำให้มีความสุขนั้นจะส่งคุณล่องลอยไปกับหมู่เมฆพร้อมความรู้สึกอันแสนหวานที่จะทำให้ความคิดสร้างสรรค์และความสุขของคุณทั่งท้นออกมา',
    price: 1870,
    img: '11.webp',
    content: 'เทอร์ปีนส์ตัวหลัก ลิโมนีน ไมร์ซีน คาริโอไฟลีน THC เฉลี่ย 20.5%'
  }
  


];

export default function Page() {
  return (
    <>
      {/* Header */}
      <header className="bg-primary text-white text-center py-5  ">
        <div className="container">
          <h1 className="display-4">กัญชาสายพันธุ์ รุนแรงที่สุด</h1>
          <p className="texth">เราก็ได้รวบรวมเอารายชื่อของสายพันธุ์ที่ขึ้นชื่อว่าให้ความเมาระดับรุนแรงมาไว้ที่นี่แล้ว</p>
          
        </div>

        <div className="line">
        <a href="https://lin.ee/T51KPWs"><img src="https://scdn.line-apps.com/n/line_add_friends/btn/th.png" alt="เพิ่มเพื่อน" height="36" border="0"/></a>
        </div>
      </header>

      {/* พื้นที่สำหรับ Banner โปรโมท */}
      <section className="container text-center my-5">
        <div className="alert alert-success">
          📢 <strong>กัญชาดี!</strong>  เทอร์ปีนส์นั้นคือสสารกลิ่นแรงที่เป็นตัวสร้างกลิ่นเฉพาะตัวให้กับกัญชาสายพันธุ์ต่าง ๆ 😍
        </div>
        <div className="alert alert-info">
          🚚 <strong>กัญชาดี!</strong> สายพันธุ์กัญชาด้านล่างนี้เป็นสายพันธุ์ที่ออกฤทธิ์รุนแรง แต่จำไว้เสมอว่ายังมีกัญชาอีกมากมายหลายพันธุ์ให้เลือกสรรค์
        </div>
      </section>

      {/* Content ส่วนแสดงสินค้าของเรา */}
      <div className="container my-5">
        <h1 className="text-center mb-4">กัญชาดี</h1>
        <div className="row">
          {/* แสดงการ์ดสินค้าโดยใช้ข้อมูลจาก sampleData */}
          {sampleData.map((product) => (
            <div className="col-md-4 mb-4" key={product.id}>
              <div className="card h-100 shadow-sm">
                {/* รูปภาพสินค้า */}
                <img
                  src={`/img/${product.img}`}
                  className="card-img-top"
                  alt={product.name}
                  style={{ height: '250px', objectFit: 'cover' }}
                />
           
                <div className="card-body">
                  <h5 className="card-title">{product.name}</h5>
                  <p className="card-text">{product.description}</p>
                  <p className="card-text text-success">ราคา: {product.price} บาท</p>
                </div>
              
                <div className="card-footer text-center">
              
             
                  <a href={`/product/${product.id}`}  className="btn btn-success ml-2">
                    สั่งซื้อทันที!
                  </a>
                </div>
              </div>
            </div>
          ))}
        </div>
      </div>

      {/* Footer */}
      <footer className="bg-dark text-white text-center py-4">
        <div className="container">
          <p className="mb-0">
            © 2023 ร้านค้า PG Phone - สมาร์ทโฟนคุณภาพเยี่ยม ราคาสุดคุ้ม พร้อมบริการหลังการขาย
          </p>
          <p>
            ติดต่อเรา: 022-970-360 | อีเมล: support@pgphone.com | Facebook: <a href="https://www.facebook.com/meedee88shopping/" className="text-white">Meedee88 Shopping</a>
          </p>
        </div>
      </footer>
    </>
  );
}